export type BookContent = {
    pageNumber?: number; text: string[]; image?: string; customType?: any
}
export const bookContent: BookContent[] = [{
    pageNumber: 1,
    text: [`הצייר והדמות`, `סיפר ואייר: אפיק פלג`],
}, {
    pageNumber: 2,
    text: [`בבית בינוני ולא נקי גר צייר שאהב לצייר.`, ``,],
}, {
    pageNumber: 3,
    text: [`הוא צייר עץ, ועוד מעט הוא יתחיל לצייר את השמיים. הוא טבל את המכחול בצבע הכחול שעל הפלטה,
והתחיל לצייר את השמיים.`],
}, {
    pageNumber: 4,
    text: [`בשמיים הוא צייר את השמש, וצייר ציפורים.`,],
},

    {
        pageNumber: 5,
        text: [`
הוא צייר את עצמו ליד העץ.
`,],
    }, {
        pageNumber: 6,
        text: [`לפתע, הדמות מהציור יצאה — והצייר דיבר עם עצמו, עם הדמות.
הצייר אמר: "שלום, מי אתה?"
הדמות ענתה: "אני אתה."
הוא לא באמת הבין איך זה קרה שיש שתיים ממנו, אז הוא אמר: "מה?!"
הוא לא ידע איך ייתכן שיש שני ציירים.`, `"אני לא מאמין שאתה אני!"
הדמות ענתה: "אבל ככה זה יצא. אי אפשר לשנות את זה, כי כבר יצאתי מהציור."`,],
    }, {
        pageNumber: 7,
        text: [`הדמות הלכה והגיעה לגן חיות מפחיד.
שם היא פגשה אריה שרצה לטרוף אותה — ולא הצליח.
`],
    }, {
        pageNumber: 8,
        text: [`הדמות ברחה לגן שעשועים, ושם היה לה כיף.
היא שיחקה, והיה שם נקי — כמו בגן משחקים בכרמיאל, ולא כמו בגן משחקים בתל אביב.
`

        ],
    }, {
        pageNumber: 9,
        text: [`הצייר התגעגע לדמות. הוא רצה שהיא תחזור.
הוא חיפש אותה, והלך לגן החיות המפחיד.
הפיל רצה להשפריץ עליו מים — אז הוא ברח.
אבל לא לגן השעשועים, אלא למקום אחר.
`],
    }, {
        pageNumber: 10,
        text: [`הצייר הלך לחווה, שם ראה תרנגולת גדולה שרצתה לנשוך בו,
כאילו שהוא האוכל שלה — אז הוא ברח שוב.
`],
    }, {
        pageNumber: 11,
        text: [`הוא התקדם קדימה, ורק ראה חלק קטן של המגלשה.
אבל לא היה לו כוח להגיע לשם, כי זה היה ממש רחוק.
אז הוא עלה לאוטובוס, כדי לנסוע אל המגלשה.
`,

        ],
    }, {
        pageNumber: 12,
        text: [`כשהגיעו — הוא הגיע לגן השעשועים. ושם מצא את הדמות.
הצייר שאל אותה אם היא רוצה לחזור לציור שלו — למקום שבו הם היו בהתחלה.
הדמות אמרה שהיא רוצה.
זה היה רחוק, אז הם נכנסו למכונית ונסעו.
`],
    }, {
        pageNumber: 13,
        text: [`כשהגיעו, הם ירדו מהאוטו, וישבו שניהם מתחת לעץ. `, `פתאום הם שמעו בומים.
הם הסתובבו — אבל זה היה פשוט חיה עם צעדים גדולים.
אז הם לא פחדו, והתעלמו מזה, כי הם ידעו מה זה.
הצייר והדמות נשארו ביחד — והם היו שמחים.
`,],
    }, {
        pageNumber: 14,
        text: [`אפיק פלג בן חמש, אוהב מגדלים, אוריגמי, לכתוב ולקרוא, להתנדנד על החבל. `, `זהו ספרו הראשון של המספר והיוצר הצעיר.
`],
    }]
